
C++ 학습로드맵

1단계 : C++기본 문법을 배우는 단계
// => C와는 다른 함수, 변수, 제어문, 캐스팅, 레퍼런스 등을 이해 
// => 클래스 기본 문법의 이해 : 생성자, 소멸자, 복사 생성자 등
// => 상속 문법의 이해 : 가상함수, 추상클래스, 인터페이스 등의 개념을 이해
// => 기타 문법의 이해 : 연산자재정의, 예외 처리등
// => STL 사용법     : Container, Iterator, Algorithm 등에 대한 기본 이해
//				     vector, map 등을 사용할수 있는 능력
//====== 여기까지가 초급 =========
// 다양한 초급 서적(강의) 참고!


2단계(옵션) : 객체지향 디자인을 배우는 단계
// => https://www.google.co.kr/books/edition/GoF%EC%9D%98_%EB%94%94%EC%9E%90%EC%9D%B8_%ED%8C%A8%ED%84%B4_%EA%B0%9C%EC%A0%95%ED%8C%90/IRG2MAAACAAJ?hl=ko
// => 위 책 참고
// => 해당 서적은 1994년에 발표 되었고, 예제가 커다란 프로젝트의 일부 내용만 보여 주므로 학습하기 어렵지만, 설명 자체는 "최고"
// => 다른 기초 서적을 한번 읽고, 위 서적을 찾아보기 용으로 사용하는 것을  권장 
// => 이 단계는 C++ 자체 보다는 "디자인 분야" 이므로 아래 내용을 먼저 학습해도 상관 없음. 



3단계 : C++문법의 깊이 있는 내용과 다양한 테크닉을 배우는 단계 ( 많은 학습량이 필요 합니다 )
// 책 : effective-C++ 2권(좀 오래된 내용 ), effective-modern C++(C++11~C++14 까지 내용)
//     

// 사이트 : isocpp.org,
//        https://www.modernescpp.com/index.php/table-of-content/ 의 주제들
//        https://en.wikibooks.org/wiki/More_C%2B%2B_Idioms 에 있는 테크닉들
//        그리고, 위 사이트들에 보면 다시 수십~수백개의 link가 있는데, 좋은 사이트가 많습니다.

// 유튜브 : cppcon 검색 - 매년 열리는 C++ 컨퍼런스에서 발표 되는 수많은 내용들.. 
//         수백~수천개의 영상이 있고 대부분의 발표자가 C++창시자, 표준위원회 위원등 대부분 검증된 개발자등..

// cppreference.com 에 있는 내용 읽기!!


4단계 : C++ TEMPLATE 문법
// => 이 분야는 일반 개발자 보다는 STL 같은 라이브러리 설계자들의 문법
// => 현업에 활용도는 높지 않지만, "오픈소스 설계자"들과 같은 레벨로 가고 싶다면 필수!


5단계 : STL 에 대한 깊이 있는 이해
// => STL 의 구현 원리
// => 다양하고 복잡한 개념에 대한 사용법등

6단계 : 최신 문법
// => C++20, 23, 26 에서 등장하는 최신 개념과 기법, 라이브러리 학습

기타
// C++로 만들어진 다양한 라이브러리에 대한 경험
// => QT, Poco, asio, boost 등의 라이브러리!!